# Section One - Working with Machine Learning
The world around you is increasingly powered by machine learning, but you donâ€™t know how to start. Here we help you get the toolbox for machine learning in Python in just 30 minutes.

# 1.1: Goals and variations in Machine Learning

# 1.3: Exploring your data using pandas

In [50]:
# query
df = pd.DataFrame(np.random.rand(10, 3), columns=list('xyz'))
df

          x         y         z
0  0.049428  0.920578  0.788714
1  0.285711  0.888506  0.324758
2  0.151997  0.880747  0.027628
3  0.106532  0.466499  0.604355
4  0.251896  0.560326  0.073755
5  0.981131  0.272537  0.860998
6  0.301034  0.329013  0.976976
7  0.395585  0.949703  0.710435
8  0.876363  0.247781  0.627287
9  0.984707  0.162863  0.177463

In [51]:
# we can query the df like this
df[(df.x< df.y) & (df.y < df.z)]

          x         y         z
3  0.106532  0.466499  0.604355
6  0.301034  0.329013  0.976976

In [52]:
# or, equivalently
df.query('(x < y) & (y < z)')

          x         y         z
3  0.106532  0.466499  0.604355
6  0.301034  0.329013  0.976976

In [56]:
# query based on the VALUE of the index
df.query('index > y > z')

          x         y         z
1  0.285711  0.888506  0.324758
2  0.151997  0.880747  0.027628
4  0.251896  0.560326  0.073755
7  0.395585  0.949703  0.710435

In [57]:
# using in and not in
df = pd.DataFrame({'a': list('aabbccddeeff'), 'b': list('aaaabbbbcccc')})
df

    a  b
0   a  a
1   a  a
2   b  a
3   b  a
4   c  b
5   c  b
6   d  b
7   d  b
8   e  c
9   e  c
10  f  c
11  f  c

In [58]:
df.query('a in b')

   a  b
0  a  a
1  a  a
2  b  a
3  b  a
4  c  b
5  c  b

In [59]:
df.query('a not in b')

    a  b
6   d  b
7   d  b
8   e  c
9   e  c
10  f  c
11  f  c

In [60]:
df.query('b == ["a", "b"]')

   a  b
0  a  a
1  a  a
2  b  a
3  b  a
4  c  b
5  c  b
6  d  b
7  d  b

In [47]:
# where
# DataFrame.where(cond, other=nan, inplace=False, axis=None, 
#     level=None, errors='raise', try_cast=False, raise_on_error=None)

s = pd.Series(range(5))
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [48]:
# select a subset
s[s > 0]

1    1
2    2
3    3
4    4
dtype: int64

In [45]:
# select a subset, but retain the shape of the Series
s.where(s > 0)

0    NaN
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [46]:
# similar, but different
s.mask(s > 0)

0    0.0
1    NaN
2    NaN
3    NaN
4    NaN
dtype: float64